espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/platform/Device/SiliconLabs/EFR32MG22/Include/efr32mg22_smu.h
/* Bit fields for SMU PPUNSFS */
#define _SMU_PPUNSFS_RESETVALUE                     0x00000000UL                              /**< Default value for SMU_PPUNSFS               */
#define _SMU_PPUNSFS_MASK                           0x000000FFUL                              /**< Mask for SMU_PPUNSFS                        */
#define _SMU_PPUNSFS_PPUFSPERIPHID_SHIFT            0                                         /**< Shift value for SMU_PPUFSPERIPHID           */
#define _SMU_PPUNSFS_PPUFSPERIPHID_MASK             0xFFUL                                    /**< Bit mask for SMU_PPUFSPERIPHID              */
#define _SMU_PPUNSFS_PPUFSPERIPHID_DEFAULT          0x00000000UL                              /**< Mode DEFAULT for SMU_PPUNSFS                */
#define SMU_PPUNSFS_PPUFSPERIPHID_DEFAULT           (_SMU_PPUNSFS_PPUFSPERIPHID_DEFAULT << 0) /**< Shifted mode DEFAULT for SMU_PPUNSFS        */

/* Bit fields for SMU BMPUNSPATD0 */
#define _SMU_BMPUNSPATD0_RESETVALUE                 0x00000000UL                                    /**< Default value for SMU_BMPUNSPATD0           */
#define _SMU_BMPUNSPATD0_MASK                       0x0000001FUL                                    /**< Mask for SMU_BMPUNSPATD0                    */
#define SMU_BMPUNSPATD0_RADIOAES                    (0x1UL << 0)                                    /**< RADIO AES DMA privileged mode               */
#define _SMU_BMPUNSPATD0_RADIOAES_SHIFT             0                                               /**< Shift value for SMU_RADIOAES                */
#define _SMU_BMPUNSPATD0_RADIOAES_MASK              0x1UL                                           /**< Bit mask for SMU_RADIOAES                   */
#define _SMU_BMPUNSPATD0_RADIOAES_DEFAULT           0x00000000UL                                    /**< Mode DEFAULT for SMU_BMPUNSPATD0            */
#define SMU_BMPUNSPATD0_RADIOAES_DEFAULT            (_SMU_BMPUNSPATD0_RADIOAES_DEFAULT << 0)        /**< Shifted mode DEFAULT for SMU_BMPUNSPATD0    */
#define SMU_BMPUNSPATD0_CRYPTOACC                   (0x1UL << 1)                                    /**< CRYPTOACC DMA privileged mode               */
#define _SMU_BMPUNSPATD0_CRYPTOACC_SHIFT            1                                               /**< Shift value for SMU_CRYPTOACC               */
#define _SMU_BMPUNSPATD0_CRYPTOACC_MASK             0x2UL                                           /**< Bit mask for SMU_CRYPTOACC                  */
#define _SMU_BMPUNSPATD0_CRYPTOACC_DEFAULT          0x00000000UL                                    /**< Mode DEFAULT for SMU_BMPUNSPATD0            */
#define SMU_BMPUNSPATD0_CRYPTOACC_DEFAULT           (_SMU_BMPUNSPATD0_CRYPTOACC_DEFAULT << 1)       /**< Shifted mode DEFAULT for SMU_BMPUNSPATD0    */
#define SMU_BMPUNSPATD0_RADIOSUBSYSTEM              (0x1UL << 2)                                    /**< RADIO subsystem manager privileged mode     */
#define _SMU_BMPUNSPATD0_RADIOSUBSYSTEM_SHIFT       2                                               /**< Shift value for SMU_RADIOSUBSYSTEM          */
#define _SMU_BMPUNSPATD0_RADIOSUBSYSTEM_MASK        0x4UL                                           /**< Bit mask for SMU_RADIOSUBSYSTEM             */
#define _SMU_BMPUNSPATD0_RADIOSUBSYSTEM_DEFAULT     0x00000000UL                                    /**< Mode DEFAULT for SMU_BMPUNSPATD0            */
#define SMU_BMPUNSPATD0_RADIOSUBSYSTEM_DEFAULT      (_SMU_BMPUNSPATD0_RADIOSUBSYSTEM_DEFAULT << 2)  /**< Shifted mode DEFAULT for SMU_BMPUNSPATD0    */
#define SMU_BMPUNSPATD0_RADIOIFADCDEBUG             (0x1UL << 3)                                    /**< RADIO IFADC debug privileged mode           */
#define _SMU_BMPUNSPATD0_RADIOIFADCDEBUG_SHIFT      3                                               /**< Shift value for SMU_RADIOIFADCDEBUG         */
#define _SMU_BMPUNSPATD0_RADIOIFADCDEBUG_MASK       0x8UL                                           /**< Bit mask for SMU_RADIOIFADCDEBUG            */
#define _SMU_BMPUNSPATD0_RADIOIFADCDEBUG_DEFAULT    0x00000000UL                                    /**< Mode DEFAULT for SMU_BMPUNSPATD0            */
#define SMU_BMPUNSPATD0_RADIOIFADCDEBUG_DEFAULT     (_SMU_BMPUNSPATD0_RADIOIFADCDEBUG_DEFAULT << 3) /**< Shifted mode DEFAULT for SMU_BMPUNSPATD0    */
#define SMU_BMPUNSPATD0_LDMA                        (0x1UL << 4)                                    /**< MCU LDMA privileged mode                    */
#define _SMU_BMPUNSPATD0_LDMA_SHIFT                 4                                               /**< Shift value for SMU_LDMA                    */
#define _SMU_BMPUNSPATD0_LDMA_MASK                  0x10UL                                          /**< Bit mask for SMU_LDMA                       */
#define _SMU_BMPUNSPATD0_LDMA_DEFAULT               0x00000000UL                                    /**< Mode DEFAULT for SMU_BMPUNSPATD0            */
#define SMU_BMPUNSPATD0_LDMA_DEFAULT                (_SMU_BMPUNSPATD0_LDMA_DEFAULT << 4)            /**< Shifted mode DEFAULT for SMU_BMPUNSPATD0    */

/** @} End of group EFR32MG22_SMU_CFGNS_BitFields */
/** @} End of group EFR32MG22_SMU_CFGNS */
/** @} End of group Parts */

#endif /* EFR32MG22_SMU_H */
